_site/personal/2014/12/15/About/index.html

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en-us">
<head>
   <meta http-equiv="content-type" content="text/html; charset=utf-8" />
   <title>About &larr; </title>
   <meta name="author" content="JinQian Chen" />

   <link rel="start" href="/" />

	
	
	
	

   <!-- syntax highlighting CSS -->
   <link rel="stylesheet" href="/assets/themes/mark-reid/css/syntax.css" type="text/css" />

   <!-- Homepage CSS -->
   <link rel="stylesheet" href="/assets/themes/mark-reid/css/screen.css" type="text/css" />

</head>
<body id="">
<div id="site">
  
  <div id="header">
    <h1>
    	<a href="/" title="HOME">HOME</a>
    	<span class="byline">&larr; <a href="/">JinQian Chen</a></span>
    </h1>
    <ul class="nav">
      <li><a class="home" href="/">Home</a></li>
      <li><a  href="/archive.html">Archive</a></li>
      <li><a  href="/pages.html">Pages</a></li>
      <li><a  href="/categories.html">Categories</a></li>
      <li><a  href="/tags.html">Tags</a></li>
    </ul>
  </div>

  
<div id="page">
	
  <h1 class="emphnext">About</h1>
  <ul class="tag_box inline">
  
  


  
     
    	<li><a href="/tags.html#poem-ref">poem <span>1</span></a></li>
     
    	<li><a href="/tags.html#record-ref">record <span>1</span></a></li>
    
  



  </ul>

  <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About Me</h2>
<div class="outline-text-2" id="text-1">
<p>
I am JinQian Chen. This is my place to record some thing in my life. Such as personal articles, book list, technique blogs. Hopefully, something here will be helpfull, that will be unexpected benefit.
</p>

<p>
I want to have a personal blog, where I can write something freely.
</p>

<p>
This should be a free land, of my own control. I used to dream of such place .
</p>

<p>
No one can walk away from his own story.     &#x2013;By Rango.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> About this Blog</h2>
<div class="outline-text-2" id="text-2">
<p>
This is my first personal blog, and I will stay here for some more time.
</p>

<p>
I will learn this today: org2blog, jekyll. and buildup the blog as much as I can. I will translate and store something about myself. About this blog, I wish one day, some one I'm interested in can find and get know me by this. …… and thanks for your supppoort.
</p>

<p>
It's a shame that I have not set up the blog theme yet, I get distorbed by sth else. And I get really not realistic altitude about my own life, get drowned in the past. I need to be real, even that means to ruin sth, and to fail. So, I decide to record sth about myself.
</p>

<p>
About the blog, in some level, it is a dream of mine, there is a place to write freely, which I have never been able to, since middle school, not been allowed before, then not been able. I have write a lot things already in my computer, I decide I should have a good place for my words.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Here are some priciples I set for myself:</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Be really really honest to myself. If you don't admit sth, does it not exist? To yourself, what harm can be done by knowing the truth? So, be real, and with that, be free.
</li>

<li>Aimed to future, live in now. The past is dead and burned, we live in the moment of now. So, work by now, love by now, change and be pain by now.
</li>

<li>Don't be always sad and negetive. Tragedy and unfortrain are real, so does happiness and complishment. Once I said to Kaitlyn, it is all dreams and mist that we live in, but what I didn't said is that, even though, dreams are important, and of meanings. Our body is build by our breath, and our city build by dream(Gibran), so, just make sure as you seek the truth, look for the big picture, not only the shadow, but also the brightness.
</li>

<li>I should get work, now. Get organised, get simple and straight forward.
</li>

<li>Failture is just one part of the whole process, to start from the begining, with lessons to learned.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> And One More Thing.</h2>
<div class="outline-text-2" id="text-4">
<p>
Only Those Who Every Day Fight for Life and Freedom Deserve It .
</p>

<p>
&#x2013;By Johann Wolfgang von Goethe, Faust.
</p>
</div>
</div>


  <address class="signature">
    <a class="author" href="/">JinQian Chen</a> 
    <span class="date">15 December 2014</span>
    <span class="location"></span>
  </address>
  
  <div class="prev-next">
  
    <a href="/tech/2016/01/16/How-I-build-this-blog" class="next" title="How I build this blog.">Next Post &rarr;</a>
  
  
  </div>
  
</div><!-- End Page -->




  
  <div id="footer">
  	<address>
  		<span class="copyright">
  			Content by <a href="/info/site.html">JinQian Chen</a>. Design by 
  			<a href="http://mark.reid.name/">Mark Reid</a>
  			<br/>
  			(<a rel="licence" href="http://creativecommons.org/licenses/by-nc-sa/3.0/">Some rights reserved</a>)			
  		</span>
  		<span class="engine">
  			Powered by <a href="http://github.com/mojombo/jekyll/" title="A static, minimalist CMS">Jekyll</a>
  		</span>
  	</address>
  </div>
  
</div>

<!--[if IE 6]>
<script type="text/javascript"> 
	/*Load jQuery if not already loaded*/ if(typeof jQuery == 'undefined'){ document.write("<script type=\"text/javascript\"   src=\"http://ajax.googleapis.com/ajax/libs/jquery/1.3.2/jquery.min.js\"></"+"script>"); var __noconflict = true; } 
	var IE6UPDATE_OPTIONS = {
		icons_path: "http://static.ie6update.com/hosted/ie6update/images/"
	}
</script>
<script type="text/javascript" src="http://static.ie6update.com/hosted/ie6update/ie6update.js"></script>
<![endif]-->

  
</body>
</html>

